//******************************************************************************
//              ОСНОВНОЙ ЗАГОЛОВОЧНЫЙ ФАЙЛ ПРОЕКТА
//******************************************************************************

//**************Подключаемые файлы**********************************************
#include "stm32f10x.h"

//**************Макроопределения************************************************

//**************Определение собственных типов***********************************

//**************Глобальные переменные доступные из других файлов****************
extern uint8_t KEY[];
extern uint8_t BUFER[16];
extern uint8_t RESULT[16];
//*************Объявление испльзуемых функций***********************************

/***************************КОНЕЦ ФАЙЛА****************************************/
