/*******************************************************************************
********************************************************************************
**                                                                            **
**                  ОСНОВНОЙ ФАЙЛ ПРОЕКТА TEST_AES                            **
**                                                                            **
********************************************************************************
*******************************************************************************/

//****************Подключаемые файлы********************************************
#include "stm32f10x_conf.h"
#include "stm32f10x.h"
#include "main.h"
#include "STM32vldiscovery.h"
#include "CRYPTO-AES.h"
//************* Инициализация глобальных переменных ****************************
 uint8_t KEY[16]=
{  'B', 'R', 'E', 'L',
   'O', 'K', 'C', 'O',
   'N', 'T', 'R', 'O',
   'L', '_', 'O', 'K'
  
};

uint8_t BUFER[16] = {'T','E','S','T','U','N','I','T','U','N','I','T','T','E','S','T'}; //Входные данные
uint8_t RESULT[16]; //Выходные данные
uint8_t OUT[16]; //Выходные данные
//******************************************************************************

void main(void) //Основная функция программы
{
       /*ИНИЦИАЛИЗАЦИЯ ПЕРЕФЕРИЙНЫХ УСТРОЙСТВ КОНТРОЛЛЕРА*/
 STM32vldiscovery_LEDInit(LED3); 
 STM32vldiscovery_LEDInit(LED4);
 
 Encrypt(KEY , BUFER , RESULT);
 
 STM32vldiscovery_LEDOn(LED3);
 
 Decrypt(KEY, RESULT ,  OUT);
 
 STM32vldiscovery_LEDOn(LED4);
 
 
  
 while(1) //Основной цикл программы
 {
 
 }
 
 
}

      /*КОНЕЦ ОСНОВНОЙ ФУНКЦИИ ПРОГРАММЫ*/




/*******************************************************************************
********************************************************************************
**                                                                            **
**                        КОНЕЦ ПРОГРАММЫ                                     **
**                                                                            **
********************************************************************************
*******************************************************************************/


