//******************************************************************************
//              ОСНОВНОЙ ЗАГОЛОВОЧНЫЙ ФАЙЛ ПРОЕКТА
//******************************************************************************

//**************Подключаемые файлы**********************************************
#include "stm32f10x.h"

//**************Макроопределения************************************************

//**************Определение собственных типов***********************************

//**************Глобальные переменные доступные из других файлов****************
extern const uint16_t Motor_run;
extern const uint16_t Motor_start;
extern FunctionalState Motor_Status;
//*************Объявление испльзуемых функций***********************************
void RCC_Configuration(void); //Включение тактироания и настройка перриферийных устройств
void GPIO_Configuration(void); //Инициализация портов ввода вывода
void TIMER_Configuration(void); //Инициализация таймера
/***************************КОНЕЦ ФАЙЛА****************************************/