//******************************************************************************
//            ЗАГОЛОВОЧНЫЙ ФАЙЛ БИБЛИОТЕКИ ФУНКЦИЙ МОДУЛЯ Bluetooth
//******************************************************************************

//*****************Подключаемые файлы*******************************************

//***************Макроопределения***********************************************
#define BLUETOOTH GPIOA
#define BLUE_RESET GPIO_Pin_8
//************* Инициализация глобальных переменных ****************************
extern const char Bluetooth_Answer2[7];
//*************Объявление испльзуемых функций***********************************
void Bluetooth_Configuration(void); //Функция инициализации Bluetooth
void Bluetooth_Read(void); //Функция чтения буфера Bluetooth
char *Bluetooth_Parser(const char *answer);