//******************************************************************************
//            ЗАГОЛОВОЧНЫЙ ФАЙЛ БИБЛИОТЕКИ ФУНКЦИЙ МОДУЛЯ НАВИГАЦЦИИ
//******************************************************************************

//*****************Подключаемые файлы*******************************************
#include "stm32f10x.h"
//***************Макроопределения***********************************************
#define NAVIGATOR GPIOB
#define NAVI_STANDBAY GPIO_Pin_12
#define NAVI_RESET GPIO_Pin_13

//************* Инициализация глобальных переменных ****************************

extern char Timestamp[6][11]; //Время снятия координат
extern char Latitude[6][9]; //Широта 
extern char Longitude[6][10]; //Долгота
extern char Speed[6][6]; //Скорость
extern char Date[6][7]; //Дата 

extern uint8_t Navi_ResetCounter; //Счетчик интервала сброса навигатора

//*************Объявление испльзуемых функций***********************************
void NAVI_Configuration(void); //Инициализация навигационного приемника
void ReadCoordinates(void); //Функция считывания координат
void NAVI_Reset(void); //Функция сброса навигатора



/***************************КОНЕЦ ФАЙЛА****************************************/