//******************************************************************************
//        ЗАГОЛОВОЧНЫЙ ФАЙЛ БИБЛИОТЕКИ ФУНКЦИЙ МОДУЛЯ СЕРВИСНЫХ НАСТРОЕК
//******************************************************************************

//*****************Подключаемые файлы*******************************************
#include "stm32f10x.h"
//***************Макроопределения***********************************************
 

/*Определение адресов переменных расположенных в виртуальном EEPROM*/
#define EE_STATUS 0
#define BRELOK_SN_1 1
#define BRELOK_SN_2 7
#define PHONE_NUMBER_1 13
#define PHONE_NUMBER_2 19
#define PHONE_NUMBER_3 25
#define CLIENT_PHONE_NUMBER_1 31
#define CLIENT_PHONE_NUMBER_2 37
#define SERVER_BB 43
#define PORT_BB 53
#define START_TIME 56
#define HEAT_TIME 57
#define OP_CL_TIME 58

/*Битовые маски для EE_STATUS-0*/

#define DS  1<<7 //Статус дефолтных настроек
#define BR1 1<<6 //Статус брелка 1
#define BR2 1<<5 //Статус брелка 2
#define PN1 1<<4 //Статус номера сим 1
#define PN2 1<<3 //Статус номера сим 2
#define PN3 1<<2 //Статус номера сим 3
#define CP1 1<<1 //Статус номера клиента 1
#define CP2 1     //Статус номера клиента 2

/*Битовые маски для EE_STATUS-1*/
#define SECUR 1 //Статус постановки на охрану

//**************Определение собственных типов***********************************

//************* Инициализация  переменных доступных из других файлов ***********

//*************Объявление испльзуемых функций***********************************
void WRITE_EE_DATA(uint8_t virtual_var, uint8_t *data); //Функция записи данных в EEPROM
void READ_EE_DATA(uint8_t virtual_var, uint8_t *data); //Функция чтения данных из EEPROM
void Write_Default_Setting(void); //Запись дефолтных настроек в EEPROM
void SERVICE(void);  //Режим сервисных наастроек
/***************************КОНЕЦ ФАЙЛА****************************************/

