//******************************************************************************
//            ЗАГОЛОВОЧНЫЙ ФАЙЛ БИБЛИОТЕКИ ФУНКЦИЙ МОДУЛЯ GSM
//******************************************************************************

//*****************Подключаемые файлы*******************************************
#include "stm32f10x.h"
//***************Макроопределения***********************************************
#define GSM_MOD GPIOC
#define GSM_ON GPIO_Pin_0
#define GSM_RESET GPIO_Pin_1
#define GSM_READY GPIO_Pin_2
#define GSM_RING GPIO_Pin_3
#define SIM1 GPIO_Pin_13
#define SIM2 GPIO_Pin_14
#define SIM3 GPIO_Pin_15
#define Beeline_OP 1
#define MTS_OP 2
#define Megafon_OP 3

//********* Инициализация глобальных переменных ****************************
extern const char PHONE_NUMBER[];

extern char IMEI[]; //Массив для IMEI

//*************Объявление испльзуемых функций***********************************
void SIM(uint8_t sim); //Функция переключения СИМ карт
void GSM_Configuration(void); //Инициализация GSM
char REG_NET(void);  //Проверка регистации в сети
void SendData_onServer(uint16_t state);  //Функция отправки данных на сервер
void ANSWER_CALL(void); //Функция ответа на входящий звонок









/***************************КОНЕЦ ФАЙЛА****************************************/