//******************************************************************************
//            ЗАГОЛОВОЧНЫЙ ФАЙЛ БИБЛИОТЕКИ ФУНКЦИЙ МОДУЛЯ НАВИГАЦЦИИ
//******************************************************************************

//*****************Подключаемые файлы*******************************************
//***************Макроопределения***********************************************
#define NAVIGATOR GPIOB
#define NAVI_STANDBAY GPIO_Pin_12
#define NAVI_RESET GPIO_Pin_13

//************* Инициализация глобальных переменных ****************************
extern char RMC[66]; //Массив сообщения RMC
//extern char Timestamp[6]; //Время снятия координат
//extern char Latitude[10]; //Широта 
//extern char Longitude[11]; //Долгота


//*************Объявление испльзуемых функций***********************************
void NAVI_Configuration(void); //Инициализация навигационного приемника
void ReadCoordinates(void); //Функция считывания координат




/***************************КОНЕЦ ФАЙЛА****************************************/