//******************************************************************************
//              ОСНОВНОЙ ЗАГОЛОВОЧНЫЙ ФАЙЛ ПРОЕКТА
//******************************************************************************

//**************Подключаемые файлы**********************************************
#include "stm32f10x.h"

//**************Макроопределения************************************************
#define red GPIO_Pin_0
#define green GPIO_Pin_1
//**************Определение собственных типов***********************************

//**************Глобальные переменные доступные из других файлов****************
extern FunctionalState delay_EnableStatus; //Статус активности программы задержки
extern uint32_t delay_Counter; //Интервал программы задержки

//*************Объявление испльзуемых функций***********************************
void delay_ms(uint16_t msec); //Задержка в милисекундах
void delay_us(uint32_t usec); //Задержка в микросекундах
void RCC_Configuration(void); //Тактирование и настройка периферийных устройств
void GPIO_Configuration(void); //Настройка параметров портов ввода вывода
void EXTI_Configuration(void); //Инициализация контроллера внешних прерываний
void NVIC_Configuration(void); //Инициализация и настройка прерываний
void SPI_Configuration(void); //Инициализация SPI

/***************************КОНЕЦ ФАЙЛА****************************************/
